<a href="https://colab.research.google.com/github/Jlfaz02/ML-Zoomcamp-Homework/blob/main/Homework_1_Intro_to_ML.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
pd.__version__

'1.4.3'

In [ ]:
data = pd.read_csv(r"C:\Users\jlbal\OneDrive\Desktop\ML Zoomcamp\raw.githubusercontent.com_alexeygrigorev_datasets_master_housing.csv")

In [ ]:
data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [ ]:
#Total rows and columns
data.shape

(20640, 10)

In [ ]:
#find columns with missing values
data.isna()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
20635,False,False,False,False,False,False,False,False,False,False
20636,False,False,False,False,False,False,False,False,False,False
20637,False,False,False,False,False,False,False,False,False,False
20638,False,False,False,False,False,False,False,False,False,False
20639,False,False,False,False,False,False,False,False,False,False

In [ ]:
#find unique values in Ocean_proximity
data['ocean_proximity'].nunique()

5

In [ ]:
#Take the avg_median_house_value of houses "NEAR BAY"

avg_median_house_value=data[data['ocean_proximity']=='NEAR BAY']['median_house_value'].mean()

In [ ]:
print(avg_median_house_value)

259212.31179039303

In [ ]:
avg_total_br = data['total_bedrooms'].mean()
print(avg_total_br)

537.8705525375618

In [ ]:
#insert mean average to null values
new = data['total_bedrooms'].fillna(data['total_bedrooms'].mean())

In [ ]:
avg_total_br_new = data['total_bedrooms'].mean()
print(avg_total_br)

537.8705525375618

In [ ]:
island_data = data.loc[data['ocean_proximity'] == 'ISLAND', ['housing_median_age', 'total_rooms', 'total_bedrooms']]

In [ ]:
island_data.head()

      housing_median_age  total_rooms  total_bedrooms
8314                27.0       1675.0           521.0
8315                52.0       2359.0           591.0
8316                52.0       2127.0           512.0
8317                52.0        996.0           264.0
8318                29.0        716.0           214.0

In [ ]:
x = island_data.values

In [ ]:
XTX = np.dot(x,x.T)

In [ ]:
inv_XTX = np.linalg.inv(XTX)

In [ ]:
y = [950,1300,800,1000,1300]

In [ ]:
XTX_t = np.dot(x.T,inv_XTX)

In [ ]:
w = np.dot(XTX_t, y)

In [ ]:
print(w)

[25.79544783 -0.67706108  2.13434696]